In [2]:
import pandas as pd

DFage=pd.read_csv("https://github.com/Bearnamedjoey/guided1/raw/main/Medianage.csv")
DFalc=pd.read_csv("https://github.com/Bearnamedjoey/guided1/raw/main/Alcohol.csv")

In [3]:
DF1=pd.merge(DFage, DFalc, on='Country')

In [4]:
DF1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 188 entries, 0 to 187
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Rank_x                  188 non-null    int64
 1   Country                 188 non-null    object
 2   Years                   188 non-null    float64
 3   Rank_y                  188 non-null    int64
 4   liters of pure alcohol  188 non-null    float64
dtypes: float64(2), int64(2), object(1)
memory usage: 8.8+ KB

In [5]:
DFobe=pd.read_csv("https://github.com/Bearnamedjoey/guided1/raw/main/obesity.csv")
DFtbc=pd.read_csv("https://github.com/Bearnamedjoey/guided1/raw/main/Tobacco.csv")

In [6]:
DF2=pd.merge(DFobe, DFtbc, on='Country')

In [7]:
DF2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 164 entries, 0 to 163
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Rank_x                  164 non-null    int64
 1   Country                 164 non-null    object
 2   Percent of Obesity      164 non-null    float64
 3   Rank_y                  164 non-null    int64
 4   Percent of Tobacco Use  164 non-null    float64
dtypes: float64(2), int64(2), object(1)
memory usage: 7.7+ KB

In [8]:
DFpeople=pd.merge(DF1, DF2, on='Country')

In [9]:
DFpeople.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 162 entries, 0 to 161
Data columns (total 9 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Rank_x_x                162 non-null    int64
 1   Country                 162 non-null    object
 2   Years                   162 non-null    float64
 3   Rank_y_x                162 non-null    int64
 4   liters of pure alcohol  162 non-null    float64
 5   Rank_x_y                162 non-null    int64
 6   Percent of Obesity      162 non-null    float64
 7   Rank_y_y                162 non-null    int64
 8   Percent of Tobacco Use  162 non-null    float64
dtypes: float64(4), int64(4), object(1)
memory usage: 12.7+ KB

In [13]:
DFpeople.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 162 entries, 0 to 161
Data columns (total 9 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Rank_x_x                162 non-null    int64
 1   Country                 162 non-null    object
 2   Years                   162 non-null    float64
 3   Rank_y_x                162 non-null    int64
 4   liters of pure alcohol  162 non-null    float64
 5   Rank_x_y                162 non-null    int64
 6   Percent of Obesity      162 non-null    float64
 7   Rank_y_y                162 non-null    int64
 8   Percent of Tobacco Use  162 non-null    float64
dtypes: float64(4), int64(4), object(1)
memory usage: 12.7+ KB

In [16]:
bye=[0,3,5,7]
DFpeople.drop(columns=DFpeople.columns[bye],inplace=True)

In [19]:
DFpeople.columns.str.capitalize()

Index(['Country', 'Years', 'Liters of pure alcohol', 'Percent of obesity',
       'Percent of tobacco use'],
      dtype='object')

In [20]:
DFpeople.to_csv("People.csv",index=False)

In [21]:
Peoplecsv=pd.read_csv('People.csv')

In [22]:
Peoplecsv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 162 entries, 0 to 161
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Country                 162 non-null    object
 1   Years                   162 non-null    float64
 2   liters of pure alcohol  162 non-null    float64
 3   Percent of Obesity      162 non-null    float64
 4   Percent of Tobacco Use  162 non-null    float64
dtypes: float64(4), object(1)
memory usage: 6.5+ KB

In [23]:
DFgdp=pd.read_csv("https://github.com/Bearnamedjoey/guided1/raw/main/GDPcapita.csv")
DFlabor=pd.read_csv("https://github.com/Bearnamedjoey/guided1/raw/main/Labor.csv")

In [29]:
DF1=pd.merge(DFgdp, DFlabor, on='name')

In [30]:
DFgini=pd.read_csv("https://github.com/Bearnamedjoey/guided1/raw/main/Gini.csv")

In [31]:
DFecon=pd.merge(DF1, DFgini, on='name')

In [32]:
DFecon

,name,slug_x,value_x,date_of_information_x,ranking_x,region_x,slug_y,value_y,date_of_information_y,ranking_y,region_y,slug,value,date_of_information,ranking,region
0,Luxembourg,luxembourg,"$115,700",2021 est.,2,Europe,luxembourg,"333,900",2021 est.,166,Europe,luxembourg,34.2,2019 est.,112,Europe
1,Singapore,singapore,"$106,000",2021 est.,4,East and Southeast Asia,singapore,"3,290,000",2021 est.,101,East and Southeast Asia,singapore,45.9,2017,28,East and Southeast Asia
2,Ireland,ireland,"$102,500",2021 est.,5,Europe,ireland,"2,518,000",2021 est.,115,Europe,ireland,30.6,2018 est.,146,Europe
3,Qatar,qatar,"$92,900",2021 est.,6,Middle East,qatar,"1,977,000",2021 est.,126,Middle East,qatar,41.1,2007,50,Middle East
4,Switzerland,switzerland,"$71,000",2021 est.,9,Europe,switzerland,"4,963,000",2021 est.,85,Europe,switzerland,32.7,2017 est.,131,Europe
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
171,Mozambique,mozambique,"$1,200",2021 est.,224,Africa,mozambique,"14,137,000",2021 est.,43,Africa,mozambique,54.0,2014 est.,8,Africa
172,Niger,niger,"$1,200",2021 est.,225,Africa,niger,"9,411,000",2021 est.,55,Africa,niger,34.3,2014 est.,111,Africa
173,"Congo, Democratic Republic of the",congo-democratic-republic-of-the,"$1,100",2021 est.,226,Africa,congo-democratic-republic-of-the,"33,382,000",2021 est.,18,Africa,congo-democratic-republic-of-the,42.1,2012 est.,45,Africa
174,Central African Republic,central-african-republic,$800,2021 est.,228,Africa,central-african-republic,"2,015,000",2021 est.,124,Africa,central-african-republic,56.2,2008 est.,5,Africa
175,Burundi,burundi,$700,2021 est.,229,Africa,burundi,"5,271,000",2021 est.,77,Africa,burundi,38.6,2013 est.,69,Africa

In [33]:
DFecon.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 176 entries, 0 to 175
Data columns (total 16 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   name                   176 non-null    object
 1   slug_x                 176 non-null    object
 2   value_x                176 non-null    object
 3   date_of_information_x  176 non-null    object
 4   ranking_x              176 non-null    int64
 5   region_x               176 non-null    object
 6   slug_y                 176 non-null    object
 7   value_y                176 non-null    object
 8   date_of_information_y  176 non-null    object
 9   ranking_y              176 non-null    int64
 10  region_y               176 non-null    object
 11  slug                   176 non-null    object
 12  value                  176 non-null    float64
 13  date_of_information    176 non-null    object
 14  ranking                176 non-null    int64
 15  region                 176 non-null    object
dtypes: float64(1), int64(3), object(12)
memory usage: 23.4+ KB

In [34]:
bye=[1,3,4,5,6,8,9,10,11,13,14,15]
DFecon.drop(columns=DFecon.columns[bye],inplace=True)

In [35]:
DFecon.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 176 entries, 0 to 175
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     176 non-null    object
 1   value_x  176 non-null    object
 2   value_y  176 non-null    object
 3   value    176 non-null    float64
dtypes: float64(1), object(3)
memory usage: 6.9+ KB

In [36]:
DFecon

                                  name   value_x     value_y  value
0                           Luxembourg  $115,700     333,900   34.2
1                            Singapore  $106,000   3,290,000   45.9
2                              Ireland  $102,500   2,518,000   30.6
3                                Qatar   $92,900   1,977,000   41.1
4                          Switzerland   $71,000   4,963,000   32.7
..                                 ...       ...         ...    ...
171                         Mozambique    $1,200  14,137,000   54.0
172                              Niger    $1,200   9,411,000   34.3
173  Congo, Democratic Republic of the    $1,100  33,382,000   42.1
174           Central African Republic      $800   2,015,000   56.2
175                            Burundi      $700   5,271,000   38.6

[176 rows x 4 columns]

In [37]:
DFecon.columns.str.replace(pat="name",
                           repl="Country", 
                           regex=True)

Index(['Country', 'value_x', 'value_y', 'value'], dtype='object')

In [38]:
DFecon.columns=DFecon.columns.str.replace("name","Country",regex=True).to_list()

In [ ]:
DFecon.columns.str.replace(pat="value_x",
                           repl="GDP per capita", 
                           regex=True)

In [39]:
DFecon.columns=DFecon.columns.str.replace("value_x","GDP per capita",regex=True).to_list()

In [ ]:
DFecon.columns.str.replace(pat="value_y",
                           repl="Labor Force", 
                           regex=True)

In [40]:
DFecon.columns=DFecon.columns.str.replace("value_y","Labor Force",regex=True).to_list()

In [41]:
DFecon.columns=DFecon.columns.str.replace("value","Gini Index",regex=True).to_list()

In [57]:
DFecon.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 176 entries, 0 to 175
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Country         176 non-null    object
 1   GDP per capita  176 non-null    object
 2   Labor Force     176 non-null    object
 3   Gini Index      176 non-null    float64
dtypes: float64(1), object(3)
memory usage: 6.9+ KB

In [ ]:
#next step: convert object to numerical value

In [60]:
DFecon['GDP per capita'] = pd.to_numeric(DFecon['GDP per capita'], errors='coerce')

In [61]:
DFecon['Labor Force'] = pd.to_numeric(DFecon['Labor Force'], errors='coerce')

In [63]:
DFecon.to_csv("Economy.csv",index=False)

In [64]:
Economycsv=pd.read_csv('Economy.csv')

In [65]:
Economycsv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 176 entries, 0 to 175
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Country         176 non-null    object
 1   GDP per capita  2 non-null      float64
 2   Labor Force     0 non-null      float64
 3   Gini Index      176 non-null    float64
dtypes: float64(3), object(1)
memory usage: 5.6+ KB

In [66]:
DFair=pd.read_csv("https://github.com/Bearnamedjoey/guided1/raw/main/Airports.csv")

In [67]:
DFwater=pd.read_csv("https://github.com/Bearnamedjoey/guided1/raw/main/Waterways.csv")

In [70]:
DF1=pd.merge(DFair, DFwater, on='name')

In [71]:
DFrail=pd.read_csv("https://github.com/Bearnamedjoey/guided1/raw/main/Railways.csv")

In [72]:
DFtrans=pd.merge(DF1, DFrail, on='name')

In [76]:
DFtrans.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 0 to 99
Data columns (total 16 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   name                   100 non-null    object
 1   slug_x                 100 non-null    object
 2   value_x                100 non-null    object
 3   date_of_information_x  100 non-null    int64
 4   ranking_x              100 non-null    int64
 5   region_x               100 non-null    object
 6   slug_y                 100 non-null    object
 7   value_y                100 non-null    object
 8   date_of_information_y  100 non-null    int64
 9   ranking_y              100 non-null    int64
 10  region_y               100 non-null    object
 11  slug                   100 non-null    object
 12  value                  100 non-null    object
 13  date_of_information    100 non-null    int64
 14  ranking                100 non-null    int64
 15  region                 100 non-null    object
dtypes: int64(6), object(10)
memory usage: 13.3+ KB

In [78]:
bye=[1,3,4,5,6,8,9,10,11,13,14,15]
DFtrans.drop(columns=DFtrans.columns[bye],inplace=True)

In [80]:
DFtrans

             name value_x  value_y      value
0   United States  13,513   41,009  293,564.2
1          Brazil   4,093   50,000   29,849.9
2          Mexico   1,714    2,900   23,389.0
3          Canada   1,467      636   49,422.0
4          Russia   1,218  102,000   85,494.0
..            ...     ...      ...        ...
95           Togo       8       50      568.0
96        Moldova       7      558    1,171.0
97          Benin       6      150      438.0
98        Albania       3       41      424.0
99     Luxembourg       2       37      271.0

[100 rows x 4 columns]

In [81]:
DFtrans.columns=DFtrans.columns.str.replace("name","Country",regex=True).to_list()

In [82]:
DFtrans.columns=DFtrans.columns.str.replace("value_x","Airports",regex=True).to_list()

In [83]:
DFtrans.columns=DFtrans.columns.str.replace("value_y","Waterways",regex=True).to_list()

In [84]:
DFtrans.columns=DFtrans.columns.str.replace("value","Railways",regex=True).to_list()

In [86]:
DFtrans['Airports'] = pd.to_numeric(DFtrans['Airports'], errors='coerce')

In [87]:
DFtrans['Waterways'] = pd.to_numeric(DFtrans['Waterways'], errors='coerce')

In [88]:
DFtrans['Railways'] = pd.to_numeric(DFtrans['Railways'], errors='coerce')

In [89]:
DFtrans.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    100 non-null    object
 1   Airports   95 non-null     float64
 2   Waterways  39 non-null     float64
 3   Railways   27 non-null     float64
dtypes: float64(3), object(1)
memory usage: 3.9+ KB

In [91]:
DFmerged = DFpeople.merge(DFecon, on='Country').merge(DFtrans, on='Country')

In [99]:
DFmerged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 90 entries, 0 to 89
Data columns (total 11 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Country                 90 non-null     object
 1   Years                   90 non-null     float64
 2   liters of pure alcohol  90 non-null     float64
 3   Percent of Obesity      90 non-null     float64
 4   Percent of Tobacco Use  90 non-null     float64
 5   GDP per capita          0 non-null      float64
 6   Labor Force             0 non-null      float64
 7   Gini Index              90 non-null     float64
 8   Airports                85 non-null     float64
 9   Waterways               35 non-null     float64
 10  Railways                23 non-null     float64
dtypes: float64(10), object(1)
memory usage: 8.4+ KB

In [100]:
bye=[5,6,9,10]
DFmerged.drop(columns=DFmerged.columns[bye],inplace=True)

In [102]:
DFmerged

,Country,Years,liters of pure alcohol,Percent of Obesity,Percent of Tobacco Use,Gini Index,Airports
0,Japan,48.6,8.36,4.3,20.1,32.9,175.0
1,Germany,47.8,10.56,22.3,22.0,31.7,539.0
2,Italy,46.5,7.65,19.9,23.1,35.2,129.0
3,Greece,45.3,6.33,24.9,33.5,33.1,77.0
4,Slovenia,44.9,11.05,20.2,22.0,24.2,16.0
...,...,...,...,...,...,...,...
85,Zambia,16.9,3.82,8.1,14.4,57.1,88.0
86,Malawi,16.8,2.04,5.8,10.8,38.5,32.0
87,"Congo, Democratic Republic of the",16.7,0.56,6.7,12.8,42.1,198.0
88,Mali,16.0,0.60,8.6,8.3,36.1,25.0
89,Uganda,15.7,6.82,5.3,8.4,42.8,47.0

In [104]:
DFmerged.to_csv("Country Comparison.csv",index=False)

In [105]:
Countrycsv=pd.read_csv('Country Comparison.csv')

In [106]:
Countrycsv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 90 entries, 0 to 89
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Country                 90 non-null     object
 1   Years                   90 non-null     float64
 2   liters of pure alcohol  90 non-null     float64
 3   Percent of Obesity      90 non-null     float64
 4   Percent of Tobacco Use  90 non-null     float64
 5   Gini Index              90 non-null     float64
 6   Airports                85 non-null     float64
dtypes: float64(6), object(1)
memory usage: 5.0+ KB